<%@ page language="java" contentType="text/html; charset=UTF-8"
    pageEncoding="UTF-8"%>
<%@include file="header.jsp" %>
	<h1>수강신청 도우미 사이트</h1>
	<h2>가. 과제 개요</h2>
	<p>
		1) 본 과제는 수강 신청 도우미 사이트를 만드는 프로그램이다.
		본 과제에서는 교과목 조회, 수정, 삭제 및 강사의 과목 등을 조회할 수 있다.
	</p>
	<p>
		2) 프로그램 개발을 위해 개발 환경을 확인하고, 필요한 설정을 수행하십시오.
	</p>
	<h2>나. 업무 요건</h2>
	<p>
		데이터베이스에 교과목과 강사 테이블을 생성하여야 한다.
		테이블의 데이터는 샘플 데이터를 참조하여 테스트를 실시하여야 한다.
	</p>
	<h3>1) 교과목</h3>
	<p>
		가) 교과목 리스트 페이지에서 교과목 등록/조회 페이지로 이동할 수 있어야 한다.
	</p>
	<p>
		나) 교과목을 등록할 수 있어야 한다.
	</p>
	<p>
		다) 교과목 상세 조회 화면에서 수정/삭제 페이지로 이동할 수 있어야 한다.
	</p>
	<p>
		라) 교과목 정보를 수정 삭제할 수 있어야 한다.
	</p>
	<h3>2) 강사</h3>
	<p>
		가) 강사 조회 페이지에서 해당 강사가 담당하고 있는 교과목을 확인할 수 있다.
	</p>
	<p>
		나) 강사를 추가 / 삭제 할 수 있다.
	</p>
<jsp:include page="footer.jsp"/>